config/Documents/МаркетинговыйИЛогистическийКонтракт.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Document>
		<Properties>
			<Name>МаркетинговыйИЛогистическийКонтракт</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Наименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Производитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Производители</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОкончаниеДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Владелец</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Согласован</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Утвержден</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПланСуммаНачислений</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>16</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипКонтракта</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипКонтракта</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособПолученияНачислений</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособПолученияНачисленийКонтракт</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоэффициентДоходности</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТрансляцияВЦО</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПланСуммаНачисленийсНДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>16</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Фирма</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Фирмы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПланированиеОплат</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПланированиеОплат</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КДот</Name>
					<Comment>календарные дни от </Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КДотДатыПоставки</Name>
					<Comment>календарные дни от даты поставки</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантыДатОтсрочки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыДатОтсрочки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СтатьиКонтракта</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СтатьяКонтракта</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.СтатьиКонтракта</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипСтатьи</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаНачала</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОкончания</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНачислений</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>16</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНачисленийсНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>16</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Поставщики</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Поставщик</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Поставщики</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоговорПоставки</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДоговорыПоставки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Изменения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипИзм</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ДействияНадДокументами</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КомментарийИзменения</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>300</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Приложения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Наименование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяФайла</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Приложение</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

config/Enums/ДействияНадДокументами.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>ДействияНадДокументами</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВводНового</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Изменение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтменаПроведения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзменениеДаты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзмТабЧасть</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзмШапка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзмТабИШапка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выгрузка</Name>
					<Comment>на аптеку</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Расценка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Загрузка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Откорректирован</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АвтоРасценка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтправленоУведомление</Name>
					<Comment>Для сообщений об ошибках.</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

config/Documents/МаркетинговыйИЛогистическийКонтракт/Ext/ObjectModule.bsl
Функция ОбновитьСписокСтатей(ВыводитьСообщения = Истина) Экспорт

	Если ВыводитьСообщения Тогда
		Сообщить("Обработка документа: "+Ссылка,СтатусСообщения.Внимание);
	КонецЕсли; 
	Возвращаем = Ложь;
	// 1. Проверка и удаление статей с МЛК, отличным от текущего
	Индекс = СтатьиКонтракта.Количество() - 1;
	Пока Индекс >=  0 Цикл
		
		СтрокаТЧ = СтатьиКонтракта.Получить(Индекс);
		Если СтрокаТЧ.СтатьяКонтракта.МаркетинговыйКонтракт.Ссылка <> Ссылка Тогда
			
			УдаленныйЭлемент = СтрокаТЧ.СтатьяКонтракта.МаркетинговыйКонтракт.Ссылка;
			СтатьиКонтракта.Удалить(Индекс);
			Если ВыводитьСообщения Тогда
				Сообщить("	Удален документ ""Статья МЛК"" "+УдаленныйЭлемент+ " т.к. МЛК указанный в документе не соответствовал текущему документу.");
			КонецЕсли; 
			Возвращаем = Истина;
			
		КонецЕсли; 
		
		Индекс = Индекс - 1;
	
	КонецЦикла;
	
	// 2. Добавление в ТЧ "забытых" статей с таким же МЛК
	МассивСсылокСтатей = Новый Массив;
	Для каждого СтрокаТЧ Из СтатьиКонтракта Цикл
		
		МассивСсылокСтатей.Добавить(СтрокаТЧ.СтатьяКонтракта.Ссылка);
		
		// Синхронизация существующих статей МЛК
		СтароеЗначениеБезНДС	= СтрокаТЧ.СуммаНачислений;
		СтароеЗначениеСНДС		= СтрокаТЧ.СуммаНачисленийсНДС;
		
		Если СтароеЗначениеБезНДС <> СтрокаТЧ.СтатьяКонтракта.СуммаБонусаПоСтатье Тогда
			
			СтрокаТЧ.СуммаНачислений = СтрокаТЧ.СтатьяКонтракта.СуммаБонусаПоСтатье;	
			Если ВыводитьСообщения Тогда
				Сообщить("	Актуализирован документ ""Статья МЛК"" "+СтрокаТЧ.СтатьяКонтракта+ " (строка "+СтрокаТЧ.НомерСтроки+")  т.к. данные в колонке <Сумма начислений> отличались от данных в документе.");
			КонецЕсли; 
		    Возвращаем = Истина;
			
		КонецЕсли; 
		
		Если СтароеЗначениеСНДС <> СтрокаТЧ.СтатьяКонтракта.СуммаБонусаПоСтатьеСНДС Тогда
			
			СтрокаТЧ.СуммаНачисленийсНДС = СтрокаТЧ.СтатьяКонтракта.СуммаБонусаПоСтатьеСНДС;	
			Если ВыводитьСообщения Тогда
				Сообщить("	Актуализирован документ ""Статья МЛК"" "+СтрокаТЧ.СтатьяКонтракта+ " (строка "+СтрокаТЧ.НомерСтроки+")  т.к. данные в колонке <Сумма начислений с НДС> отличались от данных в документе.");
			КонецЕсли; 
		    Возвращаем = Истина;
			
		КонецЕсли; 
		
	КонецЦикла;
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	СтатьиКонтракта.Ссылка КАК СтатьяКонтракта,
	|	СтатьиКонтракта.ТипСтатьи КАК ТипСтатьи,
	|	СтатьиКонтракта.НачалоДействия КАК ДатаНачала,
	|	СтатьиКонтракта.ОкончаниеДействия КАК ДатаОкончания,
	|	СтатьиКонтракта.СуммаБонусаПоСтатье КАК СуммаНачислений,
	|	СтатьиКонтракта.СуммаБонусаПоСтатьеСНДС КАК СуммаНачисленийсНДС
	|ИЗ
	|	Документ.СтатьиКонтракта КАК СтатьиКонтракта
	|ГДЕ
	|	НЕ СтатьиКонтракта.Ссылка В (&МассивСсылокСтатей)
	|	И СтатьиКонтракта.МаркетинговыйКонтракт = &МаркетинговыйКонтракт
	|	И СтатьиКонтракта.ПометкаУдаления = ЛОЖЬ";
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("МассивСсылокСтатей",МассивСсылокСтатей); 
	Запрос.УстановитьПараметр("МаркетинговыйКонтракт",Ссылка); 
	
	Результат = Запрос.Выполнить();
	Если НЕ Результат.Пустой() Тогда
	
		Выборка = Результат.Выбрать();
		Пока Выборка.Следующий() Цикл
		
			НоваяСтрака = СтатьиКонтракта.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрака,Выборка);
			Если ВыводитьСообщения Тогда
				Сообщить("	Добавлен документ ""Статья МЛК"" "+Выборка.СтатьяКонтракта);
			КонецЕсли; 
			Возвращаем = Истина;
			
		КонецЦикла;
	
	КонецЕсли;
	
	Если НЕ Возвращаем и ВыводитьСообщения Тогда
		Сообщить("	Данные документа актуальны - не обработан!");	
	КонецЕсли; 
	
	Возврат Возвращаем
	
КонецФункции // ОбновитьСписокСтатей()

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ЭтоНовый() Тогда
		
		Изменение = Изменения.Добавить();
		Изменение.Дата = ТекущаяДата();
		Изменение.КомментарийИзменения = "Создан новый документ";
		Изменение.Сотрудник = ПараметрыСеанса.ТекущийСотр;
		Изменение.ТипИзм = Перечисления.ДействияНадДокументами.ВводНового;
		
	КонецЕсли;
	
	Если РежимЗаписи = РежимЗаписиДокумента.Запись Тогда
		ПроверитьНаЗаполнение(Отказ);	
		Если Отказ Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	ПроверитьПериодДействияКонтракта(Отказ);
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;	
	
	Если НЕ ЗначениеЗаполнено(Наименование) Тогда
	
		Наименование = СокрЛП(Производитель.Наименование)+" с "+Формат(НачалоДействия,"ДФ=dd.MM.yyyy")+" по "+Формат(ОкончаниеДействия,"ДФ=dd.MM.yyyy")	
	
	КонецЕсли;
	
	ЗаписатьДействияВИсториюДокумента(Изменения,РежимЗаписи,ПометкаУдаления);	
	
КонецПроцедуры


Процедура ПриКопировании(ОбъектКопирования)
	
	Согласован = Ложь;
	Утвержден = Ложь;
	Владелец = Справочники.Сотрудники.ПустаяСсылка();
	Изменения.Очистить();
	СтатьиКонтракта.Очистить();

КонецПроцедуры

Процедура ПроверитьНаЗаполнение(Отказ)
	
	Если ТипКонтракта.Пустая() Тогда
		#Если Клиент Тогда
			Сообщить("Не выбран ТипКонтракта",СтатусСообщения.ОченьВажное);	 
		#КонецЕсли	
		Отказ = Истина;
	КонецЕсли;
	
	Если Производитель.Пустая() Тогда
		#Если Клиент Тогда
			Сообщить("Не выбран Производитель",СтатусСообщения.ОченьВажное);	 
		#КонецЕсли	
		Отказ = Истина;
	КонецЕсли;
	
	Если НачалоДействия = Дата(1,1,1) Тогда
		#Если Клиент Тогда
			Сообщить("Не выбран дата начала действия контракта",СтатусСообщения.ОченьВажное);	 
		#КонецЕсли	
		Отказ = Истина;
	КонецЕсли;
	
	Если ОкончаниеДействия = Дата(1,1,1) Тогда
		#Если Клиент Тогда
			Сообщить("Не выбран дата окончания действия контракта",СтатусСообщения.ОченьВажное);	 
		#КонецЕсли	
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроверитьПериодДействияКонтракта(Отказ) Экспорт
	Если НачалоДействия > ОкончаниеДействия Тогда
		Отказ = Истина;
		# Если Клиент Тогда
			Сообщить("Не верный период действия контракта!");;
		# КонецЕсли
	КонецЕсли;	
КонецПроцедуры //ПроверитьПериодДействияКонтракта()
